data/Examples/OpenFOAM9/airfoil_S809/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

extrudeMesh 
topoSet
createPatch -overwrite
#potentialFoam
renumberMesh -overwrite
runApplication $application
simpleFoam -postProcess -func yPlus


#------------------------------------------------------------------------------
